GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/gd32e503v-eval/board/board.h
/*
 * Copyright (c) 2006-2024 RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author         Notes
 * 2024-10-23     drifting1024   first implementation
 */
#ifndef __BOARD_H__
#define __BOARD_H__

#include "gd32e50x.h"
#include "drv_gpio.h"
#include "drv_hard_i2c.h"
#include "drv_usart.h"
#include "drv_spi.h"

#include "gd32e50x_exti.h"

#define EXT_SDRAM_BEGIN    (0xC0000000U) /* the begining address of external SDRAM */
#define EXT_SDRAM_END      (EXT_SDRAM_BEGIN + (32U * 1024 * 1024)) /* the end address of external SDRAM */

/* SPI Flash CS pin definition (software-controlled CS via GPIO) */
/* The CS pin is configured as push-pull output by rt_hw_spi_device_attach(),
   no extra GPIO setup is needed in board_msd_init.c. */
/* SPI0 CS: PE3 */
#ifndef BSP_SPI0_FLASH_CS_PIN
#define BSP_SPI0_FLASH_CS_PIN       GET_PIN(E, 3)
#endif

/* <o> Internal SRAM memory size[Kbytes] <96-128>*/
/*  <i>Default: 128*/
#ifdef __ICCARM__
/* Use *.icf ram symbal, to avoid hardcode.*/
extern char __ICFEDIT_region_RAM_end__;
#define GD32_SRAM_END          &__ICFEDIT_region_RAM_end__
#else
#define GD32_SRAM_SIZE         128
#define GD32_SRAM_END          (0x20000000 + GD32_SRAM_SIZE * 1024)
#endif

#ifdef __ARMCC_VERSION
extern int Image$$RW_IRAM1$$ZI$$Limit;
#define HEAP_BEGIN    (&Image$$RW_IRAM1$$ZI$$Limit)
#elif __ICCARM__
#pragma section="HEAP"
#define HEAP_BEGIN    (__segment_end("HEAP"))
#else
extern int __bss_end;
#define HEAP_BEGIN    (&__bss_end)
#endif

#define HEAP_END          GD32_SRAM_END

#endif

